Suggested book for learning Pandas - Data anaylsis by Wes Mcckinny (The person who discovered the pandas library)

In [2]:
import pandas as pd

In [2]:
help(pd)

Help on package pandas:

NAME
    pandas

DESCRIPTION
    pandas - a powerful data analysis and manipulation library for Python
    =====================================================================

    **pandas** is a Python package providing fast, flexible, and expressive data
    structures designed to make working with "relational" or "labeled" data both
    easy and intuitive. It aims to be the fundamental high-level building block for
    doing practical, **real world** data analysis in Python. Additionally, it has
    the broader goal of becoming **the most powerful and flexible open source data
    analysis / manipulation tool available in any language**. It is already well on
    its way toward this goal.

    Main Features
    -------------
    Here are just a few of the things that pandas does well:

      - Easy handling of missing data in floating point as well as non-floating
        point data.
      - Size mutability: columns can be inserted and deleted from DataFrame and
        higher dimensional objects
      - Automatic and explicit data alignment: objects can be explicitly aligned
        to a set of labels, or the user can simply ignore the labels and let
        `Series`, `DataFrame`, etc. automatically align the data for you in
        computations.
      - Powerful, flexible group by functionality to perform split-apply-combine
        operations on data sets, for both aggregating and transforming data.
      - Make it easy to convert ragged, differently-indexed data in other Python
        and NumPy data structures into DataFrame objects.
      - Intelligent label-based slicing, fancy indexing, and subsetting of large
        data sets.
      - Intuitive merging and joining data sets.
      - Flexible reshaping and pivoting of data sets.
      - Hierarchical labeling of axes (possible to have multiple labels per tick).
      - Robust IO tools for loading data from flat files (CSV and delimited),
        Excel files, databases, and saving/loading data from the ultrafast HDF5
        format.
      - Time series-specific functionality: date range generation and frequency
        conversion, moving window statistics, date shifting and lagging.

PACKAGE CONTENTS
    _config (package)
    _libs (package)
    _testing
    _typing
    _version
    api (package)
    arrays (package)
    compat (package)
    conftest
    core (package)
    errors (package)
    io (package)
    plotting (package)
    testing
    tests (package)
    tseries (package)
    util (package)

SUBMODULES
    _hashtable
    _lib
    _tslib
    offsets

FUNCTIONS
    __getattr__(name)

DATA
    IndexSlice = <pandas.core.indexing._IndexSlice object>
    NA = <NA>
    NaT = NaT
    __docformat__ = 'restructuredtext'
    __git_version__ = 'b687cd4d9e520666a956a60849568a98dd00c672'
    describe_option = <pandas._config.config.CallableDynamicDoc object>
    get_option = <pandas._config.config.CallableDynamicDoc object>
    options = <pandas._config.config.DictWrapper object>
    reset_option = <pandas._config.config.CallableDynamicDoc object>
    set_option = <pandas._config.config.CallableDynamicDoc object>

VERSION
    1.0.5

FILE
    c:\users\admin\anaconda3\lib\site-packages\pandas\__init__.py

Data strucutre of pandas
   1. Series --- Same as a your numpy one dimentional array, but the only difference that is it is labeled
   2. DataFrame ----- Collection of hetrogenosly typed column, which are mutable very much similar like excell spreadsheet or                         Mysql table (2D dimensional)
   3. Panel -  3D Structure similar like dataframe

In [3]:
a = pd.series([10,11,12,13,15])

AttributeError: module 'pandas' has no attribute 'series'

In [4]:
df = pd.DataFrame([1,2,4,5,9],[1,2,3,4,5])

In [5]:
df

   0
1  1
2  2
3  4
4  5
5  9

In [6]:
import numpy as np

In [10]:
a=np.random.rand(5,4)

In [11]:
a

array([[0.24530392, 0.60566791, 0.41264014, 0.10928086],
       [0.97377429, 0.78599421, 0.72801636, 0.96581838],
       [0.34261479, 0.13643286, 0.87667537, 0.21403737],
       [0.07721181, 0.28123532, 0.56123979, 0.9077092 ],
       [0.28912152, 0.8937287 , 0.49776644, 0.93998519]])

In [13]:
df1 = pd.DataFrame(a)

In [14]:
df1

          0         1         2         3
0  0.245304  0.605668  0.412640  0.109281
1  0.973774  0.785994  0.728016  0.965818
2  0.342615  0.136433  0.876675  0.214037
3  0.077212  0.281235  0.561240  0.907709
4  0.289122  0.893729  0.497766  0.939985

In [27]:
df1 = pd.DataFrame(a,index=["x","y","z","v","w"],columns=["a","b","c","d"])

In [28]:
df1

          a         b         c         d
x  0.245304  0.605668  0.412640  0.109281
y  0.973774  0.785994  0.728016  0.965818
z  0.342615  0.136433  0.876675  0.214037
v  0.077212  0.281235  0.561240  0.907709
w  0.289122  0.893729  0.497766  0.939985

In [ ]:
#Some important functions in dataframe

In [31]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, x to w
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   a       5 non-null      float64
 1   b       5 non-null      float64
 2   c       5 non-null      float64
 3   d       5 non-null      float64
dtypes: float64(4)
memory usage: 200.0+ bytes

In [32]:
df1.describe()   #---descriptive statistics

              a         b         c         d
count  5.000000  5.000000  5.000000  5.000000
mean   0.385605  0.540612  0.615268  0.627366
std    0.343472  0.323950  0.186299  0.427237
min    0.077212  0.136433  0.412640  0.109281
25%    0.245304  0.281235  0.497766  0.214037
50%    0.289122  0.605668  0.561240  0.907709
75%    0.342615  0.785994  0.728016  0.939985
max    0.973774  0.893729  0.876675  0.965818

In [34]:
df1.rename({"z":"d"})

          a         b         c         d
x  0.245304  0.605668  0.412640  0.109281
y  0.973774  0.785994  0.728016  0.965818
d  0.342615  0.136433  0.876675  0.214037
v  0.077212  0.281235  0.561240  0.907709
w  0.289122  0.893729  0.497766  0.939985

In [35]:
df1

          a         b         c         d
x  0.245304  0.605668  0.412640  0.109281
y  0.973774  0.785994  0.728016  0.965818
z  0.342615  0.136433  0.876675  0.214037
v  0.077212  0.281235  0.561240  0.907709
w  0.289122  0.893729  0.497766  0.939985

In [36]:
df1.rename({"z":"d"}, inplace = True) # --inplace to make permanent change

In [37]:
df1

          a         b         c         d
x  0.245304  0.605668  0.412640  0.109281
y  0.973774  0.785994  0.728016  0.965818
d  0.342615  0.136433  0.876675  0.214037
v  0.077212  0.281235  0.561240  0.907709
w  0.289122  0.893729  0.497766  0.939985

In [38]:
df1.rename({"x":"p", "y":"q"}, inplace=True)

In [39]:
df1

          a         b         c         d
p  0.245304  0.605668  0.412640  0.109281
q  0.973774  0.785994  0.728016  0.965818
d  0.342615  0.136433  0.876675  0.214037
v  0.077212  0.281235  0.561240  0.907709
w  0.289122  0.893729  0.497766  0.939985

In [42]:
#To fetch a column 
df1["a"]

p    0.245304
q    0.973774
d    0.342615
v    0.077212
w    0.289122
Name: a, dtype: float64

In [43]:
#To fetch the list of column

df1[["a","b"]]

          a         b
p  0.245304  0.605668
q  0.973774  0.785994
d  0.342615  0.136433
v  0.077212  0.281235
w  0.289122  0.893729

In [ ]:
#selecting rows
loc --- helps us to get row with perticular labels from DataFrame

In [46]:
df1.loc["p":"v"]   #upper bond is always included

          a         b         c         d
p  0.245304  0.605668  0.412640  0.109281
q  0.973774  0.785994  0.728016  0.965818
d  0.342615  0.136433  0.876675  0.214037
v  0.077212  0.281235  0.561240  0.907709

syntex for accessing perticular column by row - df1.loc[row,col]

In [48]:
df1.loc["p":"v", "c"] # Accesing the perticular column by row

p    0.412640
q    0.728016
d    0.876675
v    0.561240
Name: c, dtype: float64

Suppose in your dataframe 25000 rows and 1500 columns are there 
  you only wants to extract the 10000 to 1400 rows and 5000 to 9650th columns data.
    if we use loc in we have to type lots of labels and that is not a effective way.
    so to remove this problem we have iloc with us.
    **In iloc instead of using label name we use default index value.

In [49]:
df1

          a         b         c         d
p  0.245304  0.605668  0.412640  0.109281
q  0.973774  0.785994  0.728016  0.965818
d  0.342615  0.136433  0.876675  0.214037
v  0.077212  0.281235  0.561240  0.907709
w  0.289122  0.893729  0.497766  0.939985

In [50]:
df1.iloc[0:3,1:3]    # upper bond is excluded

          b         c
p  0.605668  0.412640
q  0.785994  0.728016
d  0.136433  0.876675

In [51]:
df1.head()   #--by default gives the 5 column of data

          a         b         c         d
p  0.245304  0.605668  0.412640  0.109281
q  0.973774  0.785994  0.728016  0.965818
d  0.342615  0.136433  0.876675  0.214037
v  0.077212  0.281235  0.561240  0.907709
w  0.289122  0.893729  0.497766  0.939985

In [ ]:
df1.tail()   # by default gives the last 5 column of data

In [52]:
df1.columns

Index(['a', 'b', 'c', 'd'], dtype='object')

In [ ]:
conda install PyMysql at

**Missing Data

In [3]:
import pandas as pd
import numpy as np

In [59]:
df = pd.DataFrame({"A":[1,2,np.nan], "B": [5,np.nan,np.nan], "c":[7,8,9]})

In [60]:
df

     A    B  c
0  1.0  5.0  7
1  2.0  NaN  8
2  NaN  NaN  9

In [ ]:
To check the presence of nan value
isnull(), isna()

In [61]:
df.isna()

       A      B      c
0  False  False  False
1  False   True  False
2   True   True  False

if we have 25000 rows and 25000 columns it is very difficult to check each row and column for true and false
so we have fuction called is.na().sum() which gives the sum of na value by columns

In [62]:
df.isna().sum()   # ----it checks for NaN values column wise

A    1
B    2
c    0
dtype: int64

how to deal with Nan values?
a. drop them
b. Fill them

In [63]:
df.dropna() #- bydefault it will drop all the rows consisting the null values

     A    B  c
0  1.0  5.0  7

In [64]:
df

     A    B  c
0  1.0  5.0  7
1  2.0  NaN  8
2  NaN  NaN  9

In [65]:
df.dropna(axis=1) #To drop the nan value by column wise

   c
0  7
1  8
2  9

In [66]:
df.dropna(thresh=2)   #Keep only the row with atleast two non-NA values.

     A    B  c
0  1.0  5.0  7
1  2.0  NaN  8

In [ ]:
#To fill the Nan values.

In [67]:
df.fillna(value="fill value")

            A           B  c
0           1           5  7
1           2  fill value  8
2  fill value  fill value  9

In [68]:
df.fillna(value=0)

     A    B  c
0  1.0  5.0  7
1  2.0  0.0  8
2  0.0  0.0  9

In [70]:
df.mean() #coulm wise

A    1.5
B    5.0
c    8.0
dtype: float64

In [71]:
df["A"].fillna(1.5)

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [73]:
#or

df["A"].fillna(value=df["A"].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

# Groupby

In [ ]:
The group method allows you to group rows of the data together and call agrreicated function

In [1]:
data = {"company":["Goog", "Goog","msft","msft","Oracle","Oracle"],"Emp":["Sara", "Hari","Pual","Bill","Chris","Jasmine"],
       "Sales":[200,120,340,124,243,350]}

In [4]:
df4 = pd.DataFrame(data)

In [5]:
df4

  company      Emp  Sales
0    Goog     Sara    200
1    Goog     Hari    120
2    msft     Pual    340
3    msft     Bill    124
4  Oracle    Chris    243
5  Oracle  Jasmine    350

In [8]:
df3= df4.groupby("company")

In [9]:
df3

In [11]:
df3["Sales"].mean()

company
Goog      160.0
Oracle    296.5
msft      232.0
Name: Sales, dtype: float64

Read and write data using the pandas

In [13]:
df4.to_csv("Company_data")

In [14]:
df4

  company      Emp  Sales
0    Goog     Sara    200
1    Goog     Hari    120
2    msft     Pual    340
3    msft     Bill    124
4  Oracle    Chris    243
5  Oracle  Jasmine    350

In [15]:
import os

In [20]:
os.getcwd()

'C:\\Users\\Admin'